In [22]:
import numpy as np
from pandas import DataFrame

In [23]:
dframe = DataFrame(np.arange(12).reshape((3,4)),
                  index=['NY','LA','SF'],
                  columns=['A','B','C','D'])

In [24]:
dframe

    A  B   C   D
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [25]:
str.lower('A')

'a'

In [26]:
dframe.index.map(str.lower)

array(['ny', 'la', 'sf'], dtype=object)

In [27]:
dframe.index =dframe.index.map(str.lower)

In [28]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [29]:
str.title('udemy is good')

'Udemy Is Good'

In [30]:
dframe.rename(index=str.title,columns=str.lower)

    a  b   c   d
Ny  0  1   2   3
La  4  5   6   7
Sf  8  9  10  11

In [31]:
dframe

    A  B   C   D
ny  0  1   2   3
la  4  5   6   7
sf  8  9  10  11

In [32]:
dframe.rename(index={'ny':'NEW YORK'},
             columns={'A':'ALPHA'})

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11

In [33]:
dframe.rename(index={'ny':'NEW YORK'},
             columns={'A':'ALPHA'}, inplace=True)

In [34]:
dframe

          ALPHA  B   C   D
NEW YORK      0  1   2   3
la            4  5   6   7
sf            8  9  10  11